{
  "source": "podcast_index",
  "name": "Achieve Your Ambitious Mom Life | Women in STEM, Work-Life Balance, Career Goals, Career Planning, Decision Making",
  "host": "Anokhi Kapasi, PhD - Life Planning & Career Strategist for Women in STEM",
  "description": "Have you ever been told that work-life balance for women in STEM is a myth?\nDo you want a meaningful science career and a rooted family life —but you worry that you’re “failing at both”?\nAre you running low on time, energy, and sleep, trying to keep up with grant deadlines, conferences, and kids?\nDo you wonder if negotiating career shifts, flexible jobs, STEM-adjacent roles, or maternity leave is proof you’re not a serious scientist?\nWelcome to Science Careers for Moms — a TOP 2.5% GLOBALLY RANK",
  "rss_url": "https://feed.podbean.com/solveformom/feed.xml",
  "website": "https://solveformom.podbean.com",
  "language": "en",
  "categories": [
    "Science",
    "Life",
    "Business",
    "Careers",
    "Education",
    "Self Improvement"
  ],
  "feed_id": "7006224",
  "last_episode_date": "",
  "episode_count": 111,
  "recent_episodes": [
    {
      "title": "EP 109: The Hidden Time Management Problem Sabotaging Work‑Life Balance for Moms in STEM",
      "date": "2026-02-15",
      "duration": 1633,
      "audio_url": "https://mcdn.podbean.com/mf/web/mvb2884ipb68xhdg/EP_109_-_The_Hidden_Time_Management_Problem_Sabatoging_Work-Life_Balance_for_Moms_in_STEM-Ed8oahf.mp3",
      "description": "<p>Time management for working moms in STEM shouldn't feel this hard. You get everything done—code compiles, data collected, manuscript revised—but at home? There's no clear finish line. Just that nagging feeling you could always do one more thing.</p>\n<p>In today's episode, I'm breaking down a simple 4-part framework that will help you define \"done\" intentionally so you can stop overworking and start experiencing real balance. This isn't about lowering your standards—it's about reallocating exc"
    },
    {
      "title": "EP 108: Work-Life Balance Question: What Does “Being Aligned” Really Mean as a Scientist Mom?",
      "date": "2026-02-08",
      "duration": 1018,
      "audio_url": "https://mcdn.podbean.com/mf/web/zcw9ammhdb4hi84v/EP_108_-_Work-Life_Balance-_What_Does_Being_Aligned_Really_Mean_as_a_Scientist_Mom-Ed8cnty.mp3",
      "description": "<p>Work-life balance for working moms in STEM feels like constant juggling—lab deadlines, family responsibilities, career demands, and that nagging feeling you're failing at all of it.</p>\n<p>And somehow you're still supposed to pursue meaningful work and be present with your family?</p>\n<p>This episode is your clarity.</p>\n<p>I'm walking you through what \"being aligned\" really means for scientist moms—not the vague Instagram version, but the concrete kind where your values, vision, and daily de"
    },
    {
      "title": "EP 107: Confident Decision Making for Ambitious Moms | Unlocking Intuition for Aligned Leadership [CEO: Leah Goldman]",
      "date": "2026-02-01",
      "duration": 2661,
      "audio_url": "https://mcdn.podbean.com/mf/web/gmi5qi2d3w6yxppu/EP_107_-_From_Analysis_Paralysis_to_Confident_Decision_making_-_How_Ambitious_Moms_Can_Lead_Using_Their_Intuition-Edb2i80.mp3",
      "description": "<p>For ambitious moms to turn intuition into a strategy for work-life balance</p>\n<p>Are you at a crossroads, wondering how to take the next right action to do what you want?</p>\n<p>If you’ve been stuck in analysis paralysis and overthinking every move, this episode explains how to make faster, more confident decisions at work and at home without burning out your brain.</p>\n<p>I’m joined by Leah Goldman, host of The Intuition Strategist podcast and creator of Corporate Tarot Cards®, who helps am"
    }
  ],
  "status": "discovered",
  "pursue": false,
  "notes": "",
  "contact_email": "hello@solveformom.com",
  "contact_name": "Anokhi Kapasi, PhD - Life Planning & Career Strategist for Women in STEM",
  "discovered_date": "2026-02-18",
  "slug": "achieve-your-ambitious-mom-life-women-in-stem-work-life-balance-career-goals-car",
  "relevance": "Low",
  "score_reason": "Targeted specifically at women scientists managing work-life balance, which doesn't align with Andreas's business transformation and AI implementation expertise."
}