{
  "source": "podcast_index",
  "name": "African Urban Professionals & Rural Farming - (Agricultural Markets that Favour Africa)",
  "host": "Fostina Mani",
  "description": "You can take an African out of the village, but you cannot take the village out of an African. Most of us live in the city but are farming in the village, either out of family obligation, or a deep routed desire to see agriculture work for Africa. What is the return on investment? How does that align with #Agenda2063 - \"The Africa We Want\" by 2063? Fostina Mani is championing an agricultural markets revolution that favours Africa, under her #legacy2063byfostinamani platform her version of \"The A",
  "rss_url": "https://anchor.fm/s/6f47ca38/podcast/rss",
  "website": "https://www.fostinamani.com",
  "language": "en",
  "categories": [
    "Business"
  ],
  "feed_id": "4587986",
  "last_episode_date": "",
  "episode_count": 20,
  "recent_episodes": [
    {
      "title": "Cocoon Moments Imagine, Innovate, & Implement",
      "date": "2024-04-26",
      "duration": 590,
      "audio_url": "https://anchor.fm/s/6f47ca38/podcast/play/85667543/https%3A%2F%2Fd3ctxlq1ktw2nl.cloudfront.net%2Fstaging%2F2024-3-20%2F374953024-44100-2-5da32ae22d16a.mp3",
      "description": "<p>Alone moments to think is a skill that one must cultivate.  It is very difficult to shut the door on all the noise that is around us.  From social media, not forgetting all the pressure from the perception that you have been\nleft behind.  Especially as everyone seems to be living their best life ever. The reality is we very often do not see the real story and how long it took to create the picture before us.</p>\n<p><br></p>\n<p>Many years ago,I spend quite a bit of time empowering the rural yo"
    },
    {
      "title": "Kenya's Kadogo (Micro) Economy A Serious Ecommerce Force",
      "date": "2024-01-04",
      "duration": 440,
      "audio_url": "https://anchor.fm/s/6f47ca38/podcast/play/80758504/https%3A%2F%2Fd3ctxlq1ktw2nl.cloudfront.net%2Fstaging%2F2024-0-3%2F362046670-48000-2-7358127abc724.m4a",
      "description": "<p>Kenya’s informal economy constitutes of US$136 billion. Today we are seeing large companies including leading supermarkets beginning to sell open sacks which will allow Africa’s Informal markets to cut their cloth according to the size of their pockets.  Today, package unit size no longer work, Africa wants what they can afford.</p>\n<p><br></p>\n<p>Kenya’s Safaricom and Airtel have realized Africa’s micro mass market is the way to go.  And they have literally disrupted if not taken business aw"
    },
    {
      "title": "Mentoring African Youth to The Africa We Want Agenda2063",
      "date": "2023-12-20",
      "duration": 959,
      "audio_url": "https://anchor.fm/s/6f47ca38/podcast/play/80178384/https%3A%2F%2Fd3ctxlq1ktw2nl.cloudfront.net%2Fstaging%2F2023-11-18%2F360421535-48000-2-d3da9535536a2.m4a",
      "description": "<p>An old and very valuable African tradition we unintentionally lost, which we are currently heavily paying the price for is youth mentorship.  See! In the African traditional custom, the family which normally went beyond the parents and children, and included aunties and uncles, would gather outside and sit around a fire to share stories.  </p>\n<p>The women would normally sit around the fire in the kitchen with their grandmothers, while the elders sat outside, mentoring the young men.  The Afr"
    }
  ],
  "status": "discovered",
  "pursue": false,
  "notes": "",
  "contact_email": "fostinamani@gmail.com",
  "contact_name": "Fostina Mani",
  "discovered_date": "2026-02-18",
  "slug": "african-urban-professionals-rural-farming-agricultural-markets-that-favour-afric",
  "relevance": "Low",
  "score_reason": "Africa-specific agricultural development focus, not aligned with Andreas's Canadian/North American marketing expertise."
}