{
  "source": "podcast_index",
  "name": "Ag Geek Speak",
  "host": "A Podcast for Precision Agriculture Geeks",
  "description": "GK Technology Inc Team Members, Jodi Boe and Sarah Lovas talk about precision agriculture, agriculture mapping, agronomy and drainage. ",
  "rss_url": "https://rss.buzzsprout.com/2297340.rss",
  "website": "https://www.buzzsprout.com/2297340",
  "language": "en-us",
  "categories": [
    "Technology",
    "Science"
  ],
  "feed_id": "6745074",
  "last_episode_date": "",
  "episode_count": 80,
  "recent_episodes": [
    {
      "title": "0.5 Tiny Bytes - Value of NAIP Imagery In Ag Mapping",
      "date": "2026-01-14",
      "duration": 699,
      "audio_url": "https://www.buzzsprout.com/2297340/episodes/18294366-0-5-tiny-bytes-value-of-naip-imagery-in-ag-mapping.mp3",
      "description": "<p>Sarah and Jodi discuss NAIP aerial imagery and why this high-resolution imagery is invaluable for precision agriculture work in the United States. They share workflows for validating zones, aligning layers, and spotting year-over-year patterns while noting timing pitfalls, thanks to NAIP imagery as a background source.</p><p>In this episode, we discuss...</p><p>• what NAIP is and who collects it<br/>• benefits of high resolution often associated with newer NAIP imagery<br/>• four-band imagery"
    },
    {
      "title": "20. Using Autonomous Tractors on the Farm with Matt Krueger",
      "date": "2025-12-18",
      "duration": 3326,
      "audio_url": "https://www.buzzsprout.com/2297340/episodes/18364299-20-using-autonomous-tractors-on-the-farm-with-matt-krueger.mp3",
      "description": "<p>We talk with Matt Krueger about his field-level view of autonomous tillage with a 9R series John Deere tractor, from kit installation to dust-driven safety stops, and how better boundaries and AutoPath boost both uptime and data quality. Matt's story centers on labor flexibility, real costs, and where autonomy should expand next.</p><p>In this special hour-long episode we talk:<br/>• autonomy kit details, JDLink Boost connectivity, dual receivers<br/>• autonomy-grade boundaries and safe offse"
    },
    {
      "title": "19.5 Map The Acidity, Save The Harvest",
      "date": "2025-12-10",
      "duration": 676,
      "audio_url": "https://www.buzzsprout.com/2297340/episodes/18293740-19-5-map-the-acidity-save-the-harvest.mp3",
      "description": "<p>We dig into why low (acidic) soil pH unlocks aluminum toxicity, how that halts root growth, and which crops suffer first. Then we lay out a practical plan to find acidic patches with smarter sampling, NDVI, and grid-the-zone strategies, and point to lime and buffer pH for the fix.</p><p>In this episode, we discuss...<br/>• soil pH as chemical control and pH level of 7 is neutral<br/>• aluminum toxicity risk to crops increases below 6.5 pH <br/>• wheat relatively tolerant, legumes struggle wit"
    }
  ],
  "status": "pursuing",
  "pursue": true,
  "notes": "",
  "discovered_date": "2026-02-18",
  "slug": "ag-geek-speak",
  "relevance": "Medium",
  "score_reason": "Covers precision agriculture and ag technology but appears more technical/operational rather than strategic business and AI applications.",
  "contact_email": "sarah@gktechinc.com",
  "contact_name": "A Podcast for Precision Agriculture Geeks",
  "contact_source": "rss"
}