{
  "source": "podcast_index",
  "name": "All Else Equal: Making Better Decisions",
  "host": "The Lauder Institute",
  "description": "Join Stanford GSB finance professor Jonathan Berk and Jules van Binsbergen of The Wharton School in a conversation with prominent business leaders about common flaws in the decision making process and what to do about them. Learn more at AllElseEqualPodcast.com.All Else Equal: Making Better Decisions Podcast is a production of Stanford Graduate School of Business and is produced by University FM.",
  "rss_url": "https://feeds.simplecast.com/dFXndvsL",
  "website": "http://allelseequalpodcast.com",
  "language": "en",
  "categories": [
    "Business",
    "Investing",
    "Management"
  ],
  "feed_id": "4891901",
  "last_episode_date": "",
  "episode_count": 93,
  "recent_episodes": [
    {
      "title": "Ep72 Alternatives vs. Mutual Funds: Where Should You Put Your Money",
      "date": "2026-02-04",
      "duration": 1908,
      "audio_url": "https://dts.podtrac.com/redirect.mp3/afp-233242-injected.calisto.simplecastaudio.com/0e8250d0-fe19-4ea5-bf18-91d288e188af/episodes/1cc2b11d-e8da-4394-9c21-b1500ab80124/audio/128/default.mp3?aid=rss_feed&awCollectionId=0e8250d0-fe19-4ea5-bf18-91d288e188af&awEpisodeId=1cc2b11d-e8da-4394-9c21-b1500ab80124&feed=dFXndvsL",
      "description": "<p>In the rapid-moving world of delegated money management, it is important to recognize the differences in how mutual funds and alternative assets operate. When it comes to alternatives, how do these funds wind up with strong incentive contracts for the money managers as opposed to flat fee contracts more commonly seen in mutual funds? Why do managers of alternatives cap their fund sizes when it could potentially lead to lower fees?</p><p>On this episode, hosts and finance professors Jonathan B"
    },
    {
      "title": "Ep71 “The Working From Home Revolution” with Nick Bloom",
      "date": "2026-01-22",
      "duration": 1696,
      "audio_url": "https://dts.podtrac.com/redirect.mp3/afp-233242-injected.calisto.simplecastaudio.com/0e8250d0-fe19-4ea5-bf18-91d288e188af/episodes/a004cdf3-1fc3-466c-92e9-9b051156f0e8/audio/128/default.mp3?aid=rss_feed&awCollectionId=0e8250d0-fe19-4ea5-bf18-91d288e188af&awEpisodeId=a004cdf3-1fc3-466c-92e9-9b051156f0e8&feed=dFXndvsL",
      "description": "<p>When the pandemic hit in 2020, working from home skyrocketed. Six years later, many companies have returned to in-person work, but hybrid models are still the dominant structure. So with WFH here to stay in some form, what’s the proper balance? And what are we at risk of losing in the long term with less in-office interaction?</p><p>Nick Bloom is an economics professor at Stanford University and one of the first researchers to take a serious look at the work from home phenomenon. He joins hos"
    },
    {
      "title": "Ep70 \"The Science Behind Why We Don’t Just Say What We Mean\" with Psychologist Steven Pinker - Part 2",
      "date": "2026-01-07",
      "duration": 1426,
      "audio_url": "https://dts.podtrac.com/redirect.mp3/afp-233242-injected.calisto.simplecastaudio.com/0e8250d0-fe19-4ea5-bf18-91d288e188af/episodes/0647da0d-6fcc-4598-8656-5895634137b6/audio/128/default.mp3?aid=rss_feed&awCollectionId=0e8250d0-fe19-4ea5-bf18-91d288e188af&awEpisodeId=0647da0d-6fcc-4598-8656-5895634137b6&feed=dFXndvsL",
      "description": "<p>In the final part of this two-part interview, Steven Pinker, an experimental psychologist and Harvard professor, again joins hosts and finance professors Jonathan Berk and Jules van Binsbergen to discuss his new book When Everyone Knows That Everyone Knows: Common Knowledge and the Mysteries of Money, Power, and Everyday Life.</p><p>In this episode, Jonathan and Jules break down more revelatory examples from Steven’s book that demonstrate how common knowledge is a first order explanatory vari"
    }
  ],
  "status": "declined",
  "pursue": false,
  "notes": "",
  "contact_email": "team@ventures.fm",
  "contact_name": "University.fm",
  "discovered_date": "2026-02-18",
  "slug": "all-else-equal-making-better-decisions",
  "relevance": "Medium",
  "score_reason": "Academic business decision-making podcast from top business schools could work for Andreas's intelligence economy and data-driven decision topics, though may skew theoretical."
}