{
  "source": "podcast_index",
  "name": "B2B Content Show: A Podcast About the How, What, and Why of B2B Content Marketing",
  "host": "Jeremy Shere",
  "description": "If you do B2B content marketing, you know that Content is King ... And queen, prince, duke, duchess--the whole damn court! Bottom line, for B2B marketers, content and content strategy are crucial. In this show, we explore the art & science, the opportunities and challenges, of B2B content marketing strategy, including:-What makes some content \"sticky\" and other content entirely forgettable-Scaling content without sacrificing authenticity and originality-Creating content with a point of view-Prod",
  "rss_url": "https://feeds.acast.com/public/shows/65390fa5238f610012a4115e",
  "website": "https://www.b2bcontentshow.com/",
  "language": "en",
  "categories": [
    "Business",
    "Marketing"
  ],
  "feed_id": "1711049",
  "last_episode_date": "",
  "episode_count": 401,
  "recent_episodes": [
    {
      "title": "Transforming Trade Shows into Engaging Brand Experiences w/ Todd Gregory",
      "date": "2025-01-31",
      "duration": 2122,
      "audio_url": "https://sphinx.acast.com/p/open/s/65390fa5238f610012a4115e/e/679c09796ad29b79372e33e6/media.mp3",
      "description": "<p>In this episode of the podcast, host Jeremy Shere welcomes Todd Gregory, the Regional Director for the Americas at Fifth Ring, a global B2B marketing agency. They discuss strategies for maximizing ROI from trade shows, which are often costly yet crucial for networking and business growth.</p><br><p>Todd emphasizes that many B2B companies mistakenly view trade shows as isolated events rather than integral parts of a broader marketing strategy. He critiques the common reliance on foot traffic a"
    },
    {
      "title": "Unlocking LinkedIn Success w/ Malte Lange",
      "date": "2025-01-08",
      "duration": 2475,
      "audio_url": "https://sphinx.acast.com/p/open/s/65390fa5238f610012a4115e/e/677821d4a1ad7348eb94dc9b/media.mp3",
      "description": "<p>In this episode, host Jeremy Shere sits down with Malte Lange, CEO of Lead Your Way, to delve into the intricacies of leveraging LinkedIn for B2B marketing. Malte shares his extensive experience in online marketing, particularly focusing on LinkedIn for the last five years. Together, they discuss common pitfalls solopreneurs, coaches, and consultants face on LinkedIn and provide actionable strategies to overcome them. Key takeaways include the importance of having a clear strategy, understand"
    },
    {
      "title": "B2B influence marketing w/ Nick Bennett",
      "date": "2025-01-03",
      "duration": 2114,
      "audio_url": "https://sphinx.acast.com/p/open/s/65390fa5238f610012a4115e/e/6778090cd83630b6e3f03149/media.mp3",
      "description": "<p>In this episode, host Jeremy Shere welcomes Nick Bennett, the Chief Customer Officer and Co-founder of TACK, a media network and go-to-market firm. Nick shares his journey in B2B marketing, from being a field marketer to co-founding his own company and becoming a LinkedIn influencer. They delve into the nuances of influencer marketing within the B2B space, comparing it to B2C influencer dynamics and discussing effective strategies for leveraging influencers to grow a business. Nick also talks"
    }
  ],
  "status": "declined",
  "pursue": false,
  "notes": "",
  "discovered_date": "2026-02-18",
  "slug": "b2b-content-show-a-podcast-about-the-how-what-and-why-of-b2b-content-marketing",
  "relevance": "Medium",
  "score_reason": "B2B content marketing focus aligns with Andreas's marketing expertise, but tactical content focus may not highlight his AI strategy or business-building story.",
  "contact_email": "info+65390fa5238f610012a4115e@mg-eu.acast.com",
  "contact_name": "Jeremy Shere",
  "contact_source": "rss"
}