{
  "source": "podcast_index",
  "name": "Balanced Mom Life | time management, mom guilt, decision-making, life balance, self-care",
  "host": "Sarah Colbert - Time Clarity Coach for Moms",
  "description": "Feeling stretched thin, but also wondering, “What’s next for me?”\nAs your kids become more independent, it’s easy to feel stuck—unsure where to start or how to make space for yourself again. You’re not alone.\nMidlife Unscripted is the podcast for moms of tweens and teens who are ready to rediscover life beyond motherhood—without guilt.\nHosted by Sarah Colbert—coach’s wife, mom of three teen girls, and former TV journalist—you’ll find honest conversations, relatable stories, and practical encoura",
  "rss_url": "https://feed.podbean.com/westmetromom/feed.xml",
  "website": "https://westmetromom.podbean.com",
  "language": "en",
  "categories": [
    "Kids",
    "Family",
    "Parenting",
    "Education",
    "Self Improvement",
    "Religion",
    "Spirituality"
  ],
  "feed_id": "7386587",
  "last_episode_date": "",
  "episode_count": 37,
  "recent_episodes": [
    {
      "title": "36 | Why There’s Never Enough Time for Yourself: 3 Truths for Moms of Teens",
      "date": "2026-02-12",
      "duration": 691,
      "audio_url": "https://mcdn.podbean.com/mf/web/44inrpz278akei3k/36-I_Have_No_Time_for_Myself_But_That_s_Not_the_Real_Problem_Busy_Mom_Mindset_Shift_ah7rg.mp3",
      "description": "<p>Do you feel busy all day but still can’t find time for yourself?</p>\n<p>In this episode, we’re talking about the hidden truth about time in the tween and teen years — and why so many moms feel overwhelmed even though their kids are more independent.</p>\n<p>A busy mom’s honest mindset shift about why feeling like you have no time for yourself isn’t really about time — and how seeing your days differently changes everything.</p>\n<p>You’ll hear the three biggest lessons I’ve learned about spendi"
    },
    {
      "title": "35 | Why Life Feels Off Lately (And You May Not Have Said It Out Loud)",
      "date": "2026-02-05",
      "duration": 547,
      "audio_url": "https://mcdn.podbean.com/mf/web/ykk4tc88vaw4hk7e/35_-_Why_Life_Feels_Off_Lately_And_What_Moms_Don_t_Realize_Is_Happening_6gutd.mp3",
      "description": "<p>Feeling like life is “off” even when everything seems fine? In this episode, I explore why moms of tweens and teens often feel exhausted, resentful, or disconnected—and how awareness of time management, mom guilt, self-care, decision making and life balance can help you find time for yourself without sacrificing your family. <br>\n<br>\nI share why small frustrations may actually be messages from your life, how running old decisions on autopilot quietly drains your energy, and why noticing thes"
    },
    {
      "title": "34 | The #1 Mistake I Made as a Mom of Teens—And the Boundary That Finally Freed My Time",
      "date": "2026-01-29",
      "duration": 691,
      "audio_url": "https://mcdn.podbean.com/mf/web/macznk2zb63ad9rh/34_The_1_Mistake_I_Made_as_a_Mom_of_Teens_And_the_Boundary_That_Finally_Freed_My_Time_7el80.mp3",
      "description": "<p>Do you feel exhausted at the end of the day—even when it feels like you didn’t do much?<br>\nIn this episode, I’m sharing the #1 mistake I made as a mom of teens that was quietly stealing my time, energy, and calm—and the simple boundary that helped me finally reclaim my time without guilt.</p>\n<p>If you’re a busy mom of tweens or teens who feels stretched thin, constantly managing everyone else’s needs, and struggling to find time for yourself while staying present for your family, this episo"
    }
  ],
  "status": "skipped",
  "pursue": false,
  "notes": "",
  "contact_email": "sarah@westmetromom.com",
  "contact_name": "Sarah Colbert - Time Clarity Coach for Moms",
  "discovered_date": "2026-02-18",
  "slug": "balanced-mom-life-time-management-mom-guilt-decision-making-life-balance-self-ca",
  "relevance": "Low",
  "score_reason": "This podcast focuses on moms of tweens/teens managing personal time and balance, with no overlap with Andreas's B2B marketing, AI, or traditional industry expertise."
}