{
  "source": "podcast_index",
  "name": "Business Transformation Pitch with The CX Goalkeeper",
  "host": "Gregorio Uglioni",
  "description": "Digital & Business Transformation | Customer Experience | Leadership | Innovation\n\nThis podcast goes beyond theory. It brings you real-world experiences from best-in-class experts who explore the intersection of people, technology, and measurable business results.\n\nHosted by Gregorio Uglioni—global transformation leader, keynote speaker, and recognized authority in Customer Experience (CX)—each episode features insightful conversations with top executives, innovators, and changemakers.\n\nDiscover",
  "rss_url": "https://feeds.libsyn.com/582785/rss",
  "website": "https://sites.libsyn.com/582785",
  "language": "en",
  "categories": [
    "Business",
    "Management"
  ],
  "feed_id": "1366057",
  "last_episode_date": "",
  "episode_count": 282,
  "recent_episodes": [
    {
      "title": "Redefining leadership at the intersection of transformation & technology with Andreas Giesa - Lead 26",
      "date": "2026-02-15",
      "duration": 832,
      "audio_url": "https://dts.podtrac.com/redirect.mp3/pscrb.fm/rss/p/traffic.libsyn.com/secure/3df0fa12-41df-4a82-9d39-12273ca65a1f/E280_-_Audio_-_Andreas_Giesa_1.mp3?dest-id=5053835",
      "description": "<p>This episode dives into the latest trends in AI, leadership, and digital transformation from the Lead 26 conference in Zurich. Hear firsthand insights on AI adoption, leadership challenges, and the future impact of robots and agents in the workplace. Essential listening for anyone interested in business transformation.</p> <p>about the guest:</p> <p>Andreas Giesa, Director of Digital Business Consulting at Xebia and former Head of eBusiness at Liebherr, is a visionary leader in the field of d"
    },
    {
      "title": "AI in the Contact Center: What's Real, What's Hype, What's Next? with Rick DeLisi",
      "date": "2026-02-08",
      "duration": 1828,
      "audio_url": "https://dts.podtrac.com/redirect.mp3/pscrb.fm/rss/p/traffic.libsyn.com/secure/3df0fa12-41df-4a82-9d39-12273ca65a1f/E279_-_Audio_-_Rick_DeLisi.mp3?dest-id=5053835",
      "description": "<p>This episode explores how AI is transforming contact centers, balancing cost savings with better customer and employee experiences. Rick DeLisi shares new research, practical examples, and actionable strategies for leaders looking to unlock AI's full value in customer service. Essential insights for anyone in CX or digital transformation.</p> <p>About the guest</p> <p>Rick DeLisi is an author and presenter working to help companies achieve greater customer loyalty while ALSO reducing the cost"
    },
    {
      "title": "Fans Favorite: Pivoting Strategies For Tough Customers & Tough Employees",
      "date": "2026-02-01",
      "duration": 1809,
      "audio_url": "https://dts.podtrac.com/redirect.mp3/pscrb.fm/rss/p/traffic.libsyn.com/secure/3df0fa12-41df-4a82-9d39-12273ca65a1f/E220_-_complete_audio_-_A_-_Marilyn_Suttle.mp3?dest-id=5053835",
      "description": "<p >In this episode, Marilyn Suttle shares practical strategies for dealing with tough customers and employees while creating a work environment where everyone thrives. From her groundbreaking book, Who's Your Gladys?, to her personal journey, Marilyn delivers actionable insights that redefine how leaders, teams, and organizations can improve customer interactions and employee engagement.</p> About the Guest <p >Marilyn Suttle has a proven track record of transforming customer relationships and "
    }
  ],
  "status": "pursuing",
  "pursue": true,
  "notes": "",
  "contact_email": "greg@cxgoalkeeper.com",
  "contact_name": "Gregorio Uglioni",
  "discovered_date": "2026-02-18",
  "slug": "business-transformation-pitch-with-the-cx-goalkeeper",
  "relevance": "High",
  "score_reason": "Focus on digital transformation, AI, and measurable business results for practitioners matches Andreas's intelligence economy and AI implementation expertise exactly."
}