{
  "source": "podcast_index",
  "name": "Buzzworthy Marketing Podcast | B2B Marketing for Professional Services, Advisors, and Consultants",
  "host": "Michael Buzinski",
  "description": "Send us a text Welcome back to the Buzzworthy Marketing Podcast! In today's episode, our host Michael Buzinski—known affectionately as Buzz—dives into one of the biggest challenges faced by B2B companies: visibility. But here's the catch—it's not just about being seen everywhere; it's about being seen by the right people. Buzz dismantles three dangerous myths that are costing businesses money and offers insights into the real culprits behind poor visibility, such as Swiss army knife syndrome ...",
  "rss_url": "https://feeds.captivate.fm/buzzworthy/",
  "website": "https://buzzworthymarketing.show/",
  "language": "en",
  "categories": [
    "Business",
    "Marketing",
    "Entrepreneurship"
  ],
  "feed_id": "5668313",
  "last_episode_date": "",
  "episode_count": 106,
  "recent_episodes": [
    {
      "title": "From Chaos to Scalable Marketing Systems",
      "date": "2025-09-09",
      "duration": 1006,
      "audio_url": "https://episodes.captivate.fm/episode/e1858c78-44c9-450a-8164-de6f2239b958.mp3",
      "description": "<p>If your marketing feels like a pile of apps duct-taped together by hope, this episode is for you.</p><p>In this kickoff to the Command Center series, host Michael “Buzz” Buzinski reveals the core idea behind every scalable B2B marketing engine he’s ever seen. Spoiler: it’s not hacks or trends—it’s about building a true Marketing Operating System (OS) that turns chaos into consistency.</p><h3>What You’ll Learn in This Episode:</h3>Why do most B2B firms don’t have a marketing system—they have a"
    },
    {
      "title": "Scale Without The Chaos: How Clear Identity Drives Real Growth",
      "date": "2025-08-20",
      "duration": 676,
      "audio_url": "https://episodes.captivate.fm/episode/c9f20659-659c-4d13-b8da-a6167c0d040f.mp3",
      "description": "<p>Episode 7: Scaling Smarter by Sharpening Your Identity</p><p>Scaling isn’t about adding more—it’s about sharpening your identity so your message cuts through the noise, attracts perfect-fit clients, and fuels sustainable growth.</p><p>Most entrepreneurs think scaling means doing more—more ads, more offers, more platforms. But the truth is, the businesses that grow the fastest and most profitably don’t get wider; they get deeper. In this episode, Buzz wraps up the three-part series on building"
    },
    {
      "title": "Make Your Message Unmissable, Pt. 2: Build Systems That Carry Your Identity”",
      "date": "2025-08-12",
      "duration": 670,
      "audio_url": "https://episodes.captivate.fm/episode/e9eb2282-39fb-4817-9ac1-3708bfe4be66.mp3",
      "description": "<h2>Quick Summary</h2><p>If your marketing feels like whack-a-mole, it’s not you—it’s your systems.</p><p> In this episode, Buzz shows how to hard-wire your brand identity into </p><p>the processes you already use so your message shows up the same way </p><p>everywhere—website, email, social, sales calls, even those tiny CTA </p><p>buttons. Think Starbucks-level consistency, minus the misspelled name </p><p>(unless that’s on-brand for you). The goal: small, strategic tweaks that</p><p> compound "
    }
  ],
  "status": "pursuing",
  "pursue": true,
  "notes": "",
  "discovered_date": "2026-02-18",
  "slug": "buzzworthy-marketing-podcast-b2b-marketing-for-professional-services-advisors-an",
  "relevance": "Medium",
  "score_reason": "Targets professional services and consultants with B2B marketing focus, relevant to Andreas's agency background but narrower audience than ideal.",
  "contact_email": "buzz@buzzworthy.biz",
  "contact_name": "Michael Buzinski",
  "contact_source": "web_search"
}