{
  "source": "podcast_index",
  "name": "Food Marketing Nerds Restaurant and CPG Marketing Podcast",
  "host": "Blue Bear Creative",
  "description": "In this weekly interview series, Alex Oesterle asks the hard and sometimes uncomfortable questions to dive into what's working and what isn't in world of food and beverage marketing. From CMO's to social media managers, the ideas and strategies will change the way you approach building your brand.\n\nIf you're a marketing professional in the food and beverage space or intend to launch a new product, these interviews are an amazing resource for practical tactics you can implement from day one.\n\nAft",
  "rss_url": "https://foodmarketingnerds.libsyn.com/rss",
  "website": "http://foodmarketingnerds.com",
  "language": "en",
  "categories": [
    "Business",
    "Marketing",
    "Entrepreneurship"
  ],
  "feed_id": "323974",
  "last_episode_date": "",
  "episode_count": 66,
  "recent_episodes": [
    {
      "title": "What to Know When Scaling From Farmers Markets to +5000 Stores with David Czinn",
      "date": "2020-11-18",
      "duration": 1991,
      "audio_url": "https://traffic.libsyn.com/secure/foodmarketingnerds/Final_FMN_-_What_You_Need_to_Know_When_Scaling_From_Farmers_Markets_to_5000_Stores_with_David_Czinn_01.mp3?dest-id=434535",
      "description": "<p>On the show, we have David Czinn, co-founder and president of D'Vash.</p> <p>If you're not already familiar, D'Vash's makes a line of all-natural sweeteners which are derived from superfoods, like dates and sweet potatoes, (think \"syrups\" and \"nectars\", except with 25% less sugar than regular honey). </p> <p>While the idea of using dates to create a sweetener is pretty new in the US, date syrup has been around for a long time – as in, dating back to the biblical era.</p> <p>During a trip in t"
    },
    {
      "title": "How Actually Listening to Customers Can Uncover Huge Opportunities, with Jägermeister's Chas Littlefield",
      "date": "2020-11-11",
      "duration": 1859,
      "audio_url": "https://traffic.libsyn.com/secure/foodmarketingnerds/Chas_Littlefield_Jagermeister_FINAL.mp3?dest-id=434535",
      "description": "<p >On the show today, we have Chas Littlefield, VP of Marketing for one of the largest spirit brands in the world: Jägermeister.</p> <p >As a heavy hitter in the industry, Jägermeister is recognized across the globe, in just about every country. New product launches aside, brand awareness isn't necessarily the main challenge at Jäger's scale. the question instead becomes \"how do you influence the way consumers think or feel about a brand they already  know,\" or at least think they know.</p> <p "
    },
    {
      "title": "How to Stress-Test Your Brand Strategy with Michael Keplinger",
      "date": "2020-11-04",
      "duration": 2285,
      "audio_url": "https://traffic.libsyn.com/secure/foodmarketingnerds/10.27.20_Michael_Keplinger-Smashbrand_FINAL.mp3?dest-id=434535",
      "description": "<p>Joining us on this episode, we have Michael Keplinger, Director of Strategy at Smashbrand.</p> <p>Even if you're not familiar with Michael's agency, you've certainly seen their branding and packaging work on shelves, both at grocery stores or even in your own home. Smashbrand uses a research-forward process to stress-test brand strategy and packaging design, which helps them better understand what sways consumers in a given purchase decision.</p> <p>Smashbrand works with brands like Kool-Aid,"
    }
  ],
  "status": "pursuing",
  "pursue": true,
  "notes": "",
  "discovered_date": "2026-02-18",
  "slug": "food-marketing-nerds-restaurant-and-cpg-marketing-podcast",
  "relevance": "High",
  "score_reason": "Perfect match—food marketing focus with CMO-level guests aligns with Andreas's food agency exit story and marketing AI expertise.",
  "contact_email": "alex@bluebearcreative.co",
  "contact_name": "Food Marketing Nerds",
  "contact_source": "rss"
}