{
  "source": "podcast_index",
  "name": "Freedom Found Copywriter Podcast | Business & Marketing Strategy for the Copywriting Industry",
  "host": "Krystle Church | Copywriter Mentor & Coach",
  "description": "This isn’t another podcast telling you to niche down and raise your rates. We’re breaking down what top copywriters do differently to build brands that attract premium clients and diversified revenue—without burning out.\nHosted by Copywriter Mentor Krystle Church, who’s helped hundreds of copywriters grow their revenue with client work and launch diversified revenue streams — you’ll get the strategies and revelations other shows aren’t sharing, making you say → “I wish someone had told me this s",
  "rss_url": "https://feed.podbean.com/Krystlej/feed.xml",
  "website": "https://Krystlej.podbean.com",
  "language": "en",
  "categories": [
    "Business",
    "Marketing"
  ],
  "feed_id": "3906283",
  "last_episode_date": "",
  "episode_count": 225,
  "recent_episodes": [
    {
      "title": "217. Her copy generated $1B in Revenue and Millions in royalties. Meet Kim Krause Schwalm & learn the copywriting strategies and royalty negotiations that made her successful",
      "date": "2026-02-11",
      "duration": 3632,
      "audio_url": "https://mcdn.podbean.com/mf/web/vzi6ct7tq6xux7m9/Podcast_with_Kim_Krause_Schwalm_January_20268his8.mp3",
      "description": "<p>If you’ve ever wondered how to get paid for the true value you bring to a company through campaigns they run year after year – and long after you write the initial copy → you need to hear from one of the GOATs, Kim Krause Schwalme. In this case-study-style episode, Kim lets us in on what went on behind the scenes as she grew from an in-house employee to a highly successful and sought-after copywriter in the industry, sitting in rooms with people like Jean Schwartz and other greats. <br>\n<br>\n"
    },
    {
      "title": "216. [Season 6 Premiere!!] → How I Planned Out My Year as a Copywriter (so it actually works for me)",
      "date": "2026-02-04",
      "duration": 1517,
      "audio_url": "https://mcdn.podbean.com/mf/web/rvu2x9kqk63yw56p/216_Season_6_Premiere_How_I_Planned_Out_My_Year_as_a_Copywriter_so_it_actually_works_for_me_7w3e4.mp3",
      "description": "<p>If you’re a copywriter or freelance copywriter who feels behind on your yearly planning already — or like your 2026 is not yet going according to plan — this episode is for you.</p>\n<p> </p>\n<p>Annual planning for copywriters doesn’t have to involve taking on as many clients as possible or burning yourself out on social media. And it definitely doesn’t have to involve a 20-tab spreadsheet you never look at again.</p>\n<p> </p>\n<p>In this episode, I’m breaking down how I plan my year as a copyw"
    },
    {
      "title": "215. Price Objections You’ll Hear as a Freelance Copywriter & Why",
      "date": "2025-12-17",
      "duration": 1151,
      "audio_url": "https://mcdn.podbean.com/mf/web/7pn9iqjtwjwdi4zp/215_Price_Objections_You_ll_Hear_as_a_Freelance_Copywriter_Whybeyjz.mp3",
      "description": "<p>You've raised your copywriting prices. You’re showing up. You’re sending proposals. But instead of clients saying yes, you keep hearing:</p>\n<p> </p>\n<p>“It’s too expensive.”</p>\n<p>“I need to think about it.”</p>\n<p>“Now’s not the right time.”</p>\n<p> </p>\n<p>If this has you questioning your worth, your rates, or your entire sales process—you are not alone. These are normal objections copywriters hear at every stage of business. The key is learning how to decode them instead of internalizing"
    }
  ],
  "status": "discovered",
  "pursue": false,
  "notes": "",
  "discovered_date": "2026-02-18",
  "slug": "freedom-found-copywriter-podcast-business-marketing-strategy-for-the-copywriting",
  "relevance": "Low",
  "score_reason": "Targets freelance copywriters rather than industry leaders or decision-makers in traditional sectors."
}