{
  "source": "podcast_index",
  "name": "Fuelling Foodies: The Food Marketing Podcast",
  "host": "KW Marketing",
  "description": "Fuelling Foodies is for the real food & drink founders who want to scale without the fluff. Hosted by Kate Williams, founder of KW Marketing, this podcast gives you the raw truth about growing your food business. Forget generic advice – this is about real stories, struggles, and breakthroughs.\n\nEvery episode will dive deep into what it actually takes to build and grow a food business. From expert digital marketing strategies to the gritty challenges founders face, we share what works (and what d",
  "rss_url": "https://feeds.captivate.fm/food-marketing-podcast/",
  "website": "https://kwmarketinguk.co.uk/",
  "language": "en",
  "categories": [
    "Business",
    "Marketing",
    "Arts",
    "Food",
    "Education",
    "Self Improvement"
  ],
  "feed_id": "7317319",
  "last_episode_date": "",
  "episode_count": 18,
  "recent_episodes": [
    {
      "title": "The Future Of Non-Alcoholic Wine: Growth, Taste & The Vino Zero Story",
      "date": "2026-02-13",
      "duration": 2209,
      "audio_url": "https://episodes.captivate.fm/episode/bb587a5b-cbfd-4936-a09b-f51769233c85.mp3",
      "description": "<p>Non-alcoholic wine is one of the fastest-growing categories in food & drink, but it’s also one of the most misunderstood.</p><p>In this episode of Fuelling Foodies, Kate sits down with Fiona & Alex, founders of Vino Zero, to unpack what’s really happening inside the non-alc wine space, from quality and consumer scepticism to explosive category growth and bold founder decisions.</p><p>From landing their first four pallets to supplying major hospitality venues and high-profile events, this is t"
    },
    {
      "title": "Reinventing Snacking: How Popcorn Kitchen Launched Crunch Corn & Entered a New Category",
      "date": "2026-01-30",
      "duration": 1478,
      "audio_url": "https://episodes.captivate.fm/episode/f5798dbb-4c87-4fc8-be26-a36d14067018.mp3",
      "description": "<p>Launching a new product is risky, especially in snacking.</p><p>In this episode of Fuelling Foodies: The Food Marketing Podcast, Kate sits down with Louise, Founder of Popcorn Kitchen, to unpack the real story behind the launch of Crunch Corn - from spotting white space in the savoury snacking market to building momentum in Q1 and beyond.</p><p>This is a founder-level conversation about innovation, timing, and what actually matters when you’re expanding into a new category, without losing wha"
    },
    {
      "title": "2026 Marketing Trends: Why Paid Ads Can’t Save You & What’s Actually Driving Growth Now",
      "date": "2026-01-16",
      "duration": 1869,
      "audio_url": "https://episodes.captivate.fm/episode/8d963625-d566-42b8-97fd-5f65d397363d.mp3",
      "description": "<p>January is loud. Predictions. Hot takes. New “rules” every week.</p><p>But heading into 2026, what we’re seeing across food & drink brands isn’t noise - it’s pressure.</p><p>Pressure to grow. Pressure to be everywhere. Pressure from founders who’ve done the “right” things… and still aren’t seeing the results.</p><p>So in this episode of Fuelling Foodies: The Food Marketing Podcast, we're cutting through the chaos to share what we see first-hand inside real food & drink businesses - what’s act"
    }
  ],
  "status": "pursuing",
  "pursue": true,
  "notes": "",
  "discovered_date": "2026-02-18",
  "slug": "fuelling-foodies-the-food-marketing-podcast",
  "relevance": "High",
  "score_reason": "Real food founders scaling businesses perfectly suits Andreas's agency-building story and AI marketing strategy expertise.",
  "contact_email": "hello@kwmarketinguk.co.uk",
  "contact_name": "KW Marketing",
  "contact_source": "website"
}