{
  "source": "podcast_index",
  "name": "Funnel Vision - For Performance-Driven Agencies & Marketers",
  "host": "Mikael Dia - Performance Marketing Expert",
  "description": "Welcome to Funnel Vision, hosted by Mikael Dia, Founder & CEO of Funnelytics. This weekly podcast features Founders, CEOs, and CMOs from B2B companies generating $2-30M ARR who break down the exact playbooks behind their growth engines.\n\nInstead of just talking strategy, our guests dive into specific numbers, channels, and tactics that are winning for them today. You'll hear how a SaaS founder built a content engine that generated $2.4M in qualified pipeline, or exactly how a marketing leader sc",
  "rss_url": "https://feeds.transistor.fm/funnel-vision-for-performance-driven-agencies-marketers",
  "website": "http://funnelytics.com",
  "language": "en",
  "categories": [
    "Business",
    "Marketing",
    "Entrepreneurship"
  ],
  "feed_id": "6934660",
  "last_episode_date": "",
  "episode_count": 68,
  "recent_episodes": [
    {
      "title": "$2k Deal Closed By AI with No Human Intervention - Kevin Jacobson Jr. and Joshua Collier, Levrg AI",
      "date": "2025-08-04",
      "duration": 2359,
      "audio_url": "https://media.transistor.fm/c0b26028/8e1bd157.mp3",
      "description": "<p>Joshua Collier and Kevin Jacobson Jr. (Co-founders of Levrg AI) join Mikael for a groundbreaking breakdown of how they helped a struggling fitness coach replace his human sales team with AI, generating 200 calls in 2 months and transforming his $20K/month business. </p><p>Joshua and Kevin bring 32 years of combined sales experience and have pioneered the integration of voice AI and chat AI within Go High Level, working with over 150 businesses across 100+ industries to generate millions in re"
    },
    {
      "title": "The $8.8 Million Challenge Funnel Strategy - Christian Davis, Full Stack Email Marketer",
      "date": "2025-07-25",
      "duration": 1818,
      "audio_url": "https://media.transistor.fm/4d0409f3/d9bc9c5d.mp3",
      "description": "<p>Christian Davis (Full-Stack Email Marketer) joins Mikael for an explosive breakdown of a 7-day challenge funnel that generated $8.8 million across three launches for publishing.com. Christian, who won Russell Brunson's affiliate competition for $100M Leads by 30% and has received personal replies from both Leila and Alex Hormozi praising his copy, architected this entire funnel strategy. </p><p>The challenge taught \"everyday people\" how to publish royalty-generating books on Amazon in just 7 "
    },
    {
      "title": "The Funnel Behind Mike Koenigs Latest Book - Scott Conorton, CMO of The Superpower Accelerator",
      "date": "2025-07-17",
      "duration": 2327,
      "audio_url": "https://media.transistor.fm/cebb2557/8c496dc6.mp3",
      "description": "<p>Scott Conorton (CMO for Mike Koenigs) joins Mikael for an in-depth breakdown of a high-converting book funnel that generated $9,000+ from just 1,112 page views. Scott, a seasoned copywriter who started during COVID and has written controls for major brands like Up Wellness and Backyard Vitality, convinced influencer Mike Koenigs to test cold traffic despite Mike's traditional resistance to it. </p><p>The result was \"Project Superpower,\" a $37 book funnel targeting founders and entrepreneurs w"
    }
  ],
  "status": "declined",
  "pursue": false,
  "notes": "",
  "contact_email": "team@funnelvision.media",
  "contact_name": "Mikael Dia - Performance Marketing Expert",
  "discovered_date": "2026-02-18",
  "slug": "funnel-vision-for-performance-driven-agencies-marketers",
  "relevance": "High",
  "score_reason": "Features B2B founders and CMOs discussing growth strategies and marketing playbooks, excellent fit for Andreas's agency experience and intelligence-driven marketing approach."
}