{
  "source": "podcast_index",
  "name": "Hibana: The Japan Travel, Life & Culture Guide, The Official Podcast of Hikari Travel Agency (HTA)",
  "host": "Hikari Travel Agency, LLC",
  "description": "This podcast is dedicated to sparking your interest in all things related to Japan!\nJOIN US!, as we discuss travel, culture, language, daily life, history, work, cuisine and many other aspects of Japan.\nCOME INTERACT WITH US!, as we share our personal experiences, opinions & advice for all travel and life within Japan.\nLET’S DISCOVER NEW THINGS TOGETHER!, as we interview Japanese friends, business owners and many others to explore their stories, advice & experiences relating to Japan.\nFeel free ",
  "rss_url": "https://anchor.fm/s/334f5104/podcast/rss",
  "website": "https://podcasters.spotify.com/pod/show/hibana-podcast-by-hta",
  "language": "en-us",
  "categories": [
    "Society",
    "Culture",
    "Places",
    "Travel"
  ],
  "feed_id": "3051952",
  "last_episode_date": "",
  "episode_count": 12,
  "recent_episodes": [
    {
      "title": "Japan's Nightlife - Your Guide To Enjoying The \"Afterhours\" In Japan",
      "date": "2022-05-31",
      "duration": 3496,
      "audio_url": "https://anchor.fm/s/334f5104/podcast/play/52573815/https%3A%2F%2Fd3ctxlq1ktw2nl.cloudfront.net%2Fproduction%2Fexports%2F334f5104%2F52573815%2Fd29c6d3f710cd53131e023cc7ad08b9a.m4a",
      "description": "THIS is definitely the episode you don't want to miss if you have any interest in doing anything \"after dinner\" in Japan.Isaac and Abby discuss some of the unique aspects of Japan's Nightlife culture; what it has to offer, the in's and out's and how to best enjoy it as a tourist or foreigner.They discuss some of their personal experience's of the nightlife of Japan, elaborate on their best practices and also provide details/recommendations for those unfamiliar with \"Japan at Night\".If you have a"
    },
    {
      "title": "Itadakimasu! Let's Dig Into Japanese Cuisine & Food Culture, Part 2",
      "date": "2022-03-30",
      "duration": 4034,
      "audio_url": "https://anchor.fm/s/334f5104/podcast/play/49564754/https%3A%2F%2Fd3ctxlq1ktw2nl.cloudfront.net%2Fproduction%2Fexports%2F334f5104%2F49564754%2Fe71c42d029957117f2baddc3594d8d45.m4a",
      "description": "We start off this episode with a Japanese food taste experience!Abby brings some of her favorite finds from her recent trip to an Asian food store and Isaac tastes some of them for the first time.After the taste test though, we talk more about connections between food and culture within Japan.We cover everything from children’s school lunches in Japan to Konbini’s (Japanese Convenience Stores) to how food plays into Japanese cultural holidays.Food will always be connected to any countries cultur"
    },
    {
      "title": "Itadakimasu! Let's Dig Into Japanese Cuisine & Food Culture, Part 1",
      "date": "2022-03-15",
      "duration": 3679,
      "audio_url": "https://anchor.fm/s/334f5104/podcast/play/47493708/https%3A%2F%2Fd3ctxlq1ktw2nl.cloudfront.net%2Fproduction%2Fexports%2F334f5104%2F47493708%2F76d18f6a6cecc66cdaedb86747150c3d.m4a",
      "description": "<p>The Hibana Podcast returns to talk about Japanese Food and how food relates to culture. This topic of Japanese food and culture is certainly a multi-episode topic, so if you are interested, we will discuss more on our next episode. </p><p>Unfortunately, we don't want to break any copyright (or whatever) laws, so we couldn't play the \"Sukiya\" song that we talked about for the outro, BUT here is the link to the song: Sukiya Song By Dela (It is a pretty fun song, in Isaac's opinion!) </p><p>Also"
    }
  ],
  "status": "skipped",
  "pursue": false,
  "notes": "",
  "discovered_date": "2026-02-18",
  "slug": "hibana-the-japan-travel-life-culture-guide-the-official-podcast-of-hikari-travel",
  "relevance": "Low",
  "score_reason": "Japan travel and culture podcast, completely unrelated to guest's expertise in agriculture, marketing, or AI."
}