{
  "source": "podcast_index",
  "name": "Hire Smart, Scale Fast with Hunter Miranda & Eric Farber",
  "host": "Hire Smart, Scale Fast",
  "description": "Hire Smart, Scale Fast, hosted by Hunter Miranda, with co-host, Eric Farber, is the go-to podcast for entrepreneurs, founders, and business leaders looking to build powerful, agile teams through smarter hiring. Each episode dives into the strategies, tools, and mindsets that help companies scale with purpose, especially through the use of remote and global talent.\nWhether you're a startup founder looking to make your first hire or a business owner ready to expand your team across borders, this s",
  "rss_url": "https://rss.libsyn.com/shows/579315/destinations/5021025.xml",
  "website": "https://www.HireSmartScaleFast.io",
  "language": "en-us",
  "categories": [
    "Business",
    "Entrepreneurship"
  ],
  "feed_id": "7373253",
  "last_episode_date": "",
  "episode_count": 80,
  "recent_episodes": [
    {
      "title": "Hire Remote Talent Without Adding Management Chaos",
      "date": "2026-01-15",
      "duration": 1057,
      "audio_url": "https://traffic.libsyn.com/secure/1a69fffe-deca-4399-91d8-b0dc3333965c/Ep_80_HSSF_v1.mp3?dest-id=5021025",
      "description": " <p >In episode #80, Hunter Miranda breaks down what actually makes remote hiring work for U.S. small business owners who need real capacity without losing control. He shares a practical approach to defining outcomes, hiring for reliability, and setting up lightweight systems that keep remote team members aligned. This episode is especially relevant for law firms, service providers, and founder-led teams that want to scale delivery without creating management chaos. </p>   <p > </p> <p >Takeaway"
    },
    {
      "title": "The New Outsourcing Shift: How to Build Specialized Remote Teams",
      "date": "2026-01-13",
      "duration": 1014,
      "audio_url": "https://traffic.libsyn.com/secure/1a69fffe-deca-4399-91d8-b0dc3333965c/Ep_79_HSSF_v1.mp3?dest-id=5021025",
      "description": " <p >In episode #79, Hunter Miranda shares his journey of leveraging LinkedIn to enhance his business focus on hiring and talent acquisition. He discusses the importance of understanding customer personas and reframing problems in a therapeutic manner. The conversation delves into the growing demand for specialized roles in Latin America, the shift in outsourcing trends, and the necessity of embracing technology in business operations to remain competitive. </p>   <p >  </p>   <p >Takeaways: </p"
    },
    {
      "title": "How AI Is Reshaping the Future of Entertainment and Content Creation",
      "date": "2026-01-08",
      "duration": 812,
      "audio_url": "https://traffic.libsyn.com/secure/1a69fffe-deca-4399-91d8-b0dc3333965c/Ep_78_HSSF_v1.mp3?dest-id=5021025",
      "description": " <p >In episode #78, host Hunter Miranda, discusses the shifting landscape of the entertainment industry, comparing Hollywood's stagnation to the decline of Detroit's automotive industry. He highlights the rapid growth of the creator economy, the impact of short-form video platforms like TikTok and YouTube, and the potential of AI in content creation. Hunter emphasizes the advantages of smaller, agile creator teams over traditional Hollywood structures, suggesting that the future of entertainmen"
    }
  ],
  "status": "discovered",
  "pursue": false,
  "notes": "",
  "contact_email": "Eric@farberandco.com",
  "contact_name": "Hustle & Flow Marketing Agency, LLC",
  "discovered_date": "2026-02-18",
  "slug": "hire-smart-scale-fast-with-hunter-miranda-eric-farber",
  "relevance": "Low",
  "score_reason": "Primarily focused on hiring strategies and team building rather than marketing, AI applications, or traditional industry transformation."
}