{
  "source": "podcast_index",
  "name": "Inside the Mind of Hiring with Dr. Mickey Fineberg: Business Psychologists Enabling the Selection and Preparation of Great Leaders",
  "host": "Transformation Talk Radio",
  "description": "*Step into the intricate world of hiring with Dr. Mickey in \"Inside the Mind of Hiring.\" This show dives deep into the psychology and strategy behind one of the most critical decisions leaders face: choosing the right people. Dr. Mickey reveals the often-hidden traits that make individuals right fit—or a potential mismatch—for an organization, emphasizing the profound effects that hiring choices have on company culture, morale, and effectiveness.*\n\nIn each episode, Dr. Mickey and expert guests u",
  "rss_url": "https://ttrpodcastnetwork.com/rss/host/545.xml",
  "website": "https://www.thetransformationnetwork.com",
  "language": "en-us",
  "categories": [
    "Business",
    "Management",
    "Marketing",
    "Health"
  ],
  "feed_id": "7174349",
  "last_episode_date": "",
  "episode_count": 29,
  "recent_episodes": [
    {
      "title": "Adapting to Skills Based Organizations (SBO’s)",
      "date": "2026-02-17",
      "duration": 0,
      "audio_url": "https://ttrpodcastnetwork.com/39209.mp3?1771417782",
      "description": "A\nskills-based organization (SBO) uses a dynamic system, that includes AI, to\ncontinuously map and update people’s skill and role requirements.. SBO’s\noutperform companies that remain focused on job titles because they can achieve\nbetter workforce agility, quicker role staffing, faster redeployment in\nreorganizations or crises, and more fluid internal ability. This is because AI\nsurfaces transferrable skills and inferred skills (from a person’s background,\nbehaviors, and experiences). These skil"
    },
    {
      "title": "The kind of People Companies Want in 2026",
      "date": "2026-02-03",
      "duration": 0,
      "audio_url": "https://ttrpodcastnetwork.com/39140.mp3?1770157015",
      "description": "This\nshow will focus on the key characteristics that hiring managers are\nprioritizing for 2026 and likely a good bit beyond. They are being more\nselective now and are trying to recruit people for all seasons, or truly\nwell-rounded individuals. So, for hiring managers who want to achieve\ncompetitive advantage and job seekers who want to be ahead of the crowd, this\nepisode is for you.<br>\n <br>"
    },
    {
      "title": "Organizational Culture",
      "date": "2026-01-20",
      "duration": 0,
      "audio_url": "https://ttrpodcastnetwork.com/39076.mp3?1768941191",
      "description": "I\nrecall attending a seminar where the recruiter-presenter was talking about the\nimportance of cultural fit in hiring the right people. When I asked him to\ndefine culture, I got a lot of mumbo jumbo, not a clear enough definition.\nShortly after this seminar, I saw a culture definition that made sense: <b>Behavior\nthat is tolerated and Rewarded/Behavior that is Frowned upon and Punished.</b><br>\nMost\nof the CEO’s and business owners I’ve met, read about, and heard say that\ncultural fit is the mos"
    }
  ],
  "status": "discovered",
  "pursue": false,
  "notes": "",
  "contact_email": "producer@transformationtalkradio.com",
  "contact_name": "Transformation Radio - New Mainstream in Talk Radio",
  "discovered_date": "2026-02-18",
  "slug": "inside-the-mind-of-hiring-with-dr-mickey-fineberg-business-psychologists-enablin",
  "relevance": "Low",
  "score_reason": "Focused exclusively on hiring psychology and talent selection, which doesn't align with Andreas's expertise in AI, marketing, or traditional industry transformation."
}