{
  "source": "podcast_index",
  "name": "Leaders of B2B Podcast - Interviews on Business Leadership, B2B Sales, B2B Marketing and Revenue Growth",
  "host": "Content Allies - B2B Podcast Production",
  "description": "A weekly show where we bring you interviews and in the weeds expertise from today’s B2B experts and thought leaders. You can see more about today’s episode and guest by visiting our website at LeadersOfB2B.com\n\nTopics for the show include: B2B leadership, B2B Tech, B2B SaaS, B2B CEO's, Venture-Backed Startups, B2B Growth, Analytics, Demand Generation, B2B Marketing, and more.",
  "rss_url": "https://feeds.cohostpodcasting.com/TpoCpIgd",
  "website": "https://www.leadersofb2b.com/",
  "language": "en",
  "categories": [
    "Business",
    "Management",
    "Marketing"
  ],
  "feed_id": "1420554",
  "last_episode_date": "",
  "episode_count": 236,
  "recent_episodes": [
    {
      "title": "Creating Human-Centered Workplaces in the Age of AI with Oz Rashid at MSH",
      "date": "2025-11-18",
      "duration": 2157,
      "audio_url": "https://audio-delivery.cohostpodcasting.com/audio/8ca0d585-d021-4f54-990a-8974c443b680/episodes/8dd0f254-7180-4938-872a-b4a417dc695f/episode.mp3",
      "description": "<p>True leadership isn’t about authority — it’s about connection, empathy and purpose. In this episode, Oz Rashid, Founder and CEO of MSH and Host of the “Hire Learning” podcast, dives into leadership, culture and the evolving expectations of today’s workforce. Drawing from his extensive experience in talent strategy, Oz explores what it takes to build high-performing teams in a rapidly changing business landscape. The discussion centers around people-first leadership, authenticity and the power"
    },
    {
      "title": "Modernizing Impact Strategy with Neelima Grover of Q2Impact",
      "date": "2025-10-01",
      "duration": 1744,
      "audio_url": "https://audio-delivery.cohostpodcasting.com/audio/8ca0d585-d021-4f54-990a-8974c443b680/episodes/d599b485-ae42-4d58-bba7-d530db4d35b7/episode.mp3",
      "description": "<p>Losing 85% of her company portfolio became the catalyst for radical reinvention. In this episode, we're joined by Neelima Grover, Founder and CEO of Q2IMPACT. She shares hard-won insights from navigating transformation, crisis and reinvention at the helm of a global consulting firm. </p><p><br></p><p>Neelima explores how Q2IMPACT, after losing 85% of its business due to a governmental shift, pivoted to become an AI-first organization while continuing to serve global development and national s"
    },
    {
      "title": "Making the Invisible Visible: Team Utilization Strategy with Michael Daoud of Visus LLC",
      "date": "2025-04-21",
      "duration": 1097,
      "audio_url": "https://audio-delivery.cohostpodcasting.com/audio/8ca0d585-d021-4f54-990a-8974c443b680/episodes/95bd9cf1-1197-490a-8ed2-426c7f0cb60f/episode.mp3",
      "description": "<p>Utilization isn’t just a metric — it’s the key to unlocking profitability, clarity and accountability across your entire team. In this episode, Michael Daoud, Founder and CEO of Visus LLC, sits down with us to share how transparency in utilization can transform operational efficiency in professional services firms. He highlights the value of role-based utilization targets and the importance of weekly over monthly KPI tracking for agility. </p><p><br></p><p>Key Takeaways:</p><p>﻿﻿</p><p>(00:54"
    }
  ],
  "status": "discovered",
  "pursue": false,
  "notes": "",
  "discovered_date": "2026-02-18",
  "slug": "leaders-of-b2b-podcast-interviews-on-business-leadership-b2b-sales-b2b-marketing",
  "relevance": "High",
  "score_reason": "Interviews B2B leaders and executives about business strategy and growth, excellent fit for Andreas's agency exit story and leadership experience.",
  "contact_email": "support@contentallies.com",
  "contact_name": "Content Allies",
  "contact_source": "rss"
}