{
  "source": "podcast_index",
  "name": "M&A Talk: #1 Podcast on Selling a Business",
  "host": "Morgan & Westfield",
  "description": "M&A Talk is the #1 show for owners looking to sell and maximize the value of their businesses. Gain actionable insights from experts with real-world experience in buying and selling companies. Presented by Morgan & Westfield, a boutique M&A firm specializing in selling small to mid-sized companies in the USA.\nSchedule a free consultation at www.morganandwestfield.com/schedule-a-consultation/",
  "rss_url": "https://matalk.libsyn.com/rss",
  "website": "https://morganandwestfield.com/resources/podcast/",
  "language": "en",
  "categories": [
    "Business",
    "Education"
  ],
  "feed_id": "4774164",
  "last_episode_date": "",
  "episode_count": 241,
  "recent_episodes": [
    {
      "title": "M&A Earnouts for VC-Backed Companies",
      "date": "2026-02-09",
      "duration": 1837,
      "audio_url": "https://traffic.libsyn.com/secure/matalk/MA_Talk_Mital_Makadia_and_David_Siegel_01.26.26Final.mp3?dest-id=3217487",
      "description": "<p>Learn how to bridge the price gap when selling your company without losing control of your future payments. This episode reveals why you should never rely on verbal promises and how to lock in your earnout through ironclad legal protections. Discover the secrets to maintaining your budget and team after the deal closes so you actually get paid every dollar you deserve.</p> <p>View the complete show notes for this episode.</p> <p>Want To Learn More?</p>  Earnouts When Selling or Buying a Busin"
    },
    {
      "title": "Why Most Founders Fail to Sell and How to Fix It",
      "date": "2026-02-03",
      "duration": 2093,
      "audio_url": "https://traffic.libsyn.com/secure/matalk/MA_Talk_Josh_Davis_Final.mp3?dest-id=3217487",
      "description": "<p>Most business owners unknowingly lower their company's value by staying too involved in daily tasks. Learn how to remove yourself and build a self-sustaining asset that attracts premium offers. This episode reveals the systems and leadership structures you need to attract high-value buyers and ensure a smooth transition.</p> <p><br /> View the complete show notes for this episode.</p> <p><br /> Want To Learn More? </p>  Adjusting Financial Statements: A Complete Guide EBITDA | Definition, For"
    },
    {
      "title": "How a Quality of Earning Protects Your Multi-Million Dollar Exit",
      "date": "2026-01-26",
      "duration": 2979,
      "audio_url": "https://traffic.libsyn.com/secure/matalk/MA_Talk_Elliott_Holland_Final.mp3?dest-id=3217487",
      "description": "<p>Don't let a buyer slash your purchase price during the final days of a deal because you failed to prepare your financials for heavy scrutiny.</p> <p><br /> View the complete show notes for this episode.</p> <p>Want To Learn More?</p>  Quality of Earnings in M&A – The Ultimate Guide Most Common Deal Killers When Selling Your Business M&A Due Diligence | Checklist & Overview  <p > Additional Resources:</p>   Selling your business?  Schedule a free consultation today. "
    }
  ],
  "status": "pursuing",
  "pursue": true,
  "notes": "",
  "discovered_date": "2026-02-18",
  "slug": "ma-talk-1-podcast-on-selling-a-business",
  "relevance": "High",
  "score_reason": "Perfect fit for guest's experience building, scaling, and successfully exiting Nourish Food Marketing agency.",
  "contact_email": "info@morganandwestfield.com",
  "contact_name": "Morgan & Westfield",
  "contact_source": "rss"
}