{
  "source": "podcast_index",
  "name": "Marketing Leadership Podcast: Strategies From Wise D2C & B2B Marketers",
  "host": "Dots Loves Marketing",
  "description": "Join me as I soak up wisdom from CMOs, thought leaders, and marketing-loving business leaders worldwide.\n\nTogether, we'll uncover the secrets of Brand Marketing and Performance Marketing Strategies, from organic and paid media campaigns to marketing intelligence for predictable business growth. Our scope covers the D2C and B2B world.\n\nSo far, we've had Bryan Kramer, Howard Tiersky, Neal Schaffer, Robert Rose, Drew Neisser, Julian Juenemann, Rand Fishkin, Dana DiTomaso, Ardath Albee, David Bain, ",
  "rss_url": "https://feeds.cohostpodcasting.com/dkuDkSkv",
  "website": "https://www.dotslovesmarketing.com/",
  "language": "en",
  "categories": [
    "Business",
    "Marketing"
  ],
  "feed_id": "6346377",
  "last_episode_date": "",
  "episode_count": 131,
  "recent_episodes": [
    {
      "title": "Mark Evans — Skills To Becoming a Business-Building Marketing Leader",
      "date": "2026-01-15",
      "duration": 1727,
      "audio_url": "https://pdcn.co/e/audio-delivery.cohostpodcasting.com/audio/f6c98cd4-2d79-4714-97f2-b06ae160d3a8/episodes/b40bfc0d-bfb9-4d6d-b718-dbd35ff80efa/episode.mp3",
      "description": "<p>Dots Oyebolu welcomes Mark Evans, Founder and Fractional CMO of Marketing Spark. Mark shares his journey from technology journalism to advising SaaS companies on growth and strategy. The conversation focuses on why brand positioning is crucial to achieving product-market fit, how weak differentiation limits demand generation and why many companies overinvest in tactics at the expense of fundamentals. Mark also explains how marketing leaders can drive organizational change, build stronger part"
    },
    {
      "title": "Jessica Rhodes — Grow Your Podcast with Predictable Podcast Guesting Strategies",
      "date": "2026-01-08",
      "duration": 2017,
      "audio_url": "https://pdcn.co/e/audio-delivery.cohostpodcasting.com/audio/f6c98cd4-2d79-4714-97f2-b06ae160d3a8/episodes/782f4853-9f40-4c79-975b-254ed99ccaf2/episode.mp3",
      "description": "<p>Join Dots Oyebolu as he talks with Jessica Rhodes, Founder of Interview Connections. Jessica shares how interview-based shows can grow networks and audiences while solo formats work best for nurturing an existing audience. She explains how to define podcast goals, identify ideal guest segments and use guesting to drive high-quality leads. The conversation digs into prep calls as a “great divide” in podcasting, balancing rapport building with scale. Jessica also outlines what makes a compellin"
    },
    {
      "title": "Eric Montgomery — The Benefits of Using Branded Podcasts for Brand Growth",
      "date": "2025-12-18",
      "duration": 2452,
      "audio_url": "https://pdcn.co/e/audio-delivery.cohostpodcasting.com/audio/f6c98cd4-2d79-4714-97f2-b06ae160d3a8/episodes/44823bc8-da50-440f-80f3-9b582c85dad8/episode.mp3",
      "description": "<p>Dots Oyebolu speaks with Eric Montgomery, Founder of The Podcast Haven. Eric shares how he moved from music and voiceover engineering into building a podcast production company. He explains why brands should focus on niche audiences, how company culture shapes a show and why host choice matters. He also reflects on creativity, experimentation and the discipline required to deliver high-quality audio in a crowded podcast market.</p><p><br></p><p>Key Takeaways:</p><p><br></p><p>00:00 Introducti"
    }
  ],
  "status": "pursuing",
  "pursue": true,
  "notes": "",
  "discovered_date": "2026-02-18",
  "slug": "marketing-leadership-podcast-strategies-from-wise-d2c-b2b-marketers",
  "relevance": "Medium",
  "score_reason": "Interviews CMOs and marketing leaders about strategies, good fit for Andreas's agency-building story but broader than his AI/traditional industry focus.",
  "contact_email": "dotsluv.cohost@fwd.appbind.com",
  "contact_name": "Dots Oyebolu",
  "contact_source": "rss"
}