{
  "source": "podcast_index",
  "name": "Off the Fence with Karen Covy: Mastering Decision Making, Divorce & More",
  "host": "Karen Covy",
  "description": "When your future is on the line, making the right decision can feel impossible—especially when emotions are high, the stakes are huge, and the pressure is real.Karen Covy, a nationally recognized divorce coach, lawyer, mediator, and decision strategist with over 30 years of experience, Karen helps high-achieving professionals navigate life's toughest crossroads with clarity and confidence. Each week on the top-ranking Off the Fence podcast, Karen sits down with thought leaders, industry experts,",
  "rss_url": "https://rss.buzzsprout.com/2144220.rss",
  "website": "https://karencovy.com",
  "language": "en-us",
  "categories": [
    "Education",
    "Self Improvement",
    "Society",
    "Culture",
    "Relationships",
    "Kids",
    "Family"
  ],
  "feed_id": "6213834",
  "last_episode_date": "",
  "episode_count": 171,
  "recent_episodes": [
    {
      "title": "How to Have Productive Money Conversations With Your Spouse",
      "date": "2026-02-18",
      "duration": 1940,
      "audio_url": "https://www.buzzsprout.com/2144220/episodes/18591998-how-to-have-productive-money-conversations-with-your-spouse.mp3",
      "description": "<p>Money fights don’t usually start with numbers. They start with invisible beliefs you don’t realize you’re carrying, and they show up in the money conversations you have or don’t have with your spouse. </p><p>In this podcast episode, <b>Terry Gaspard</b>, a licensed therapist, author, and relationship expert, explains why money becomes such a charged issue in relationships and how childhood experiences shape our money beliefs in ways we rarely recognize. </p><p>Drawing from both professional r"
    },
    {
      "title": "How to Clear Old Trauma and Create Extraordinary Love",
      "date": "2026-02-11",
      "duration": 2746,
      "audio_url": "https://www.buzzsprout.com/2144220/episodes/18214750-how-to-clear-old-trauma-and-create-extraordinary-love.mp3",
      "description": "<p>What if the real block between you and the extraordinary love you want isn’t dating apps or “bad luck,” but the stories your nervous system is still carrying? In this podcast episode, relationship mentor Riana Malia shares how her own history of divorce, betrayal, a DEA raid, and multiple abusive relationships pushed her to develop a way of clearing decades of stored trauma without rehashing every detail in therapy. </p><p>Riana explains how tapping into the unconscious mind, releasing old em"
    },
    {
      "title": "How to Know if Your Divorce Attorney IS the Problem",
      "date": "2026-02-04",
      "duration": 2587,
      "audio_url": "https://www.buzzsprout.com/2144220/episodes/18582316-how-to-know-if-your-divorce-attorney-is-the-problem.mp3",
      "description": "<p><b>What if the biggest obstacle in your divorce isn't your spouse, but the system itself?</b> Jonathan Merel, a progressive Chicago family law and divorce attorney with over 20 years of experience, reveals the hidden dynamics that can turn even amicable divorces into drawn-out nightmares. From lawyers who overpromise to judges who won't decide, he explains why some divorces cost fortunes while others resolve efficiently.</p><p>In this podcast episode, we dive deeply into high-conflict divorce"
    }
  ],
  "status": "discovered",
  "pursue": false,
  "notes": "",
  "discovered_date": "2026-02-18",
  "slug": "off-the-fence-with-karen-covy-mastering-decision-making-divorce-more",
  "relevance": "Low",
  "score_reason": "Focused on divorce and personal relationship decisions, completely outside Andreas's professional expertise in business, AI, and marketing."
}