{
  "source": "podcast_index",
  "name": "Podcast Marketing Trends Explained: Data-Driven Podcast Growth Strategies",
  "host": "Jeremy Enns & Justin Jackson | Podcast Growth, Marketing & Promotion Experts",
  "description": "It's easier than ever to launch and produce a podcast. But it's never been harder to grow one.\n\nOn this show, we break down and explore what the data says about what it takes to market and grow a podcast in 2025 to help you make smarter decisions about your show, grow faster, and earn more.\n\nTogether, cohosts—and longtime podcasters, creators, and marketers—Jeremy Enns (Podcast Marketing Academy) and Justin Jackson (Transistor.fm) explore topics like:\n\nHow do you define success for your podcast?",
  "rss_url": "https://feeds.transistor.fm/podcast-marketing-trends-explained",
  "website": "https://podcastmarketingacademy.com/",
  "language": "en",
  "categories": [
    "Business",
    "Marketing",
    "Technology"
  ],
  "feed_id": "6752716",
  "last_episode_date": "",
  "episode_count": 26,
  "recent_episodes": [
    {
      "title": "Season Wrap Up & A Preview Of What's Coming Next",
      "date": "2025-05-07",
      "duration": 749,
      "audio_url": "https://op3.dev/e/media.transistor.fm/7c85239a/2d647d8e.mp3",
      "description": "<p>We've reached the end of Season two, but are by no means slowing down. Here's what we're going to be up to over the next few months between seasons.</p><p>⭐️ Get a free podcast marketing audit with personalized recommendations to help you grow: https://podcastmarketingacademy.com/audit ⭐️</p><p><br>Subscribe to Podcast Marketing Trends Explained</p><p>Check out the Podcast Marketing Trends 2024 Report</p><p>Subscribe to the Scrappy Podcasting Newsletter</p><p>Try Transistor.fm for free for 14"
    },
    {
      "title": "The Real Odds of Succeeding as a Podcaster (& How to Beat Them) | Podcast Strategy",
      "date": "2025-04-30",
      "duration": 3662,
      "audio_url": "https://op3.dev/e/media.transistor.fm/491ce5f7/e817dc10.mp3",
      "description": "<p>One in ten music albums makes its money back. The same is true for startups and movies. But what about podcasts?</p><p>Is it possible for any of us to create a successful show? Or are the odds always going to be stacked against us, with only a tiny fraction of shows breaking through to the mainstream? </p><p>In this episode, we break down the odds behind creating both a successful show and a successful career as a creator, and explore exactly what you can do to stack the deck in your favour.<"
    },
    {
      "title": "Is It Just Harder to Grow a Podcast Now (& If Not, Where Are the Hidden Opportunities)? | Podcast Strategy",
      "date": "2025-04-23",
      "duration": 2917,
      "audio_url": "https://op3.dev/e/media.transistor.fm/68163a20/fec698fe.mp3",
      "description": "<p>Over the past year, median podcast growth rates were nearly flat. In other words, the typical show experienced almost zero growth over the previous 12 months. </p><p>If you’ve been in podcasting for a while, this might correspond with your feeling that it is harder to grow today than it once was. And yet… while growth may have slowed for the typical show, there are others that are unlocking more and faster growth than ever before. </p><p>So what’s going on here? And what do we as creators nee"
    }
  ],
  "status": "discovered",
  "pursue": false,
  "notes": "",
  "discovered_date": "2026-02-18",
  "slug": "podcast-marketing-trends-explained-data-driven-podcast-growth-strategies",
  "relevance": "Low",
  "score_reason": "Specifically about podcast growth tactics, not about AI, marketing strategy, or traditional industries.",
  "contact_email": "jeremy@podcastmarketingacademy.com",
  "contact_name": "Jeremy Enns",
  "contact_source": "rss"
}