{
  "source": "podcast_index",
  "name": "Small Business Sisterhood Podcast: Online Business, Blogging, Creative Entrepreneurs, Business Community",
  "host": "Pepper Makepeace: Entrepreneur, Business Systems & Social Media Marketing Strategy, Solopreneur Consulting",
  "description": "Go behind the scenes with female entrepreneurs as they reveal the struggles, strategies, and inspiring stories of successful small businesses. Hosted by Pepper Makepeace, an online business strategist for female solopreneurs and side hustlers and founder of the Small Business Sisterhood - an online membership community serving small business owners in the first stages of business. If you’re interested in connecting with like-minded women, learning effective business strategies from the experts, ",
  "rss_url": "https://feeds.soundcloud.com/users/soundcloud:users:272141288/sounds.rss",
  "website": "http://smallbusinesssisterhood.com",
  "language": "en",
  "categories": [
    "Business"
  ],
  "feed_id": "677672",
  "last_episode_date": "",
  "episode_count": 49,
  "recent_episodes": [
    {
      "title": "#49 Rhonda Mincey - balancing the need for profit with purpose",
      "date": "2021-10-09",
      "duration": 2143,
      "audio_url": "http://dts.podtrac.com/redirect.mp3/feeds.soundcloud.com/stream/1139979628-smallbusinesssisterhood-49-rhonda-mincey-balancing-the-need-for-profit-with-purpose.mp3",
      "description": "Rhonda G. Mincey is a multi-award-winning mentor, entrepreneur, and inspirational expert for female entrepreneurs. Her genius and gift is to create profit-producing and legacy-building content that distinguishes businesses from the competition. Through her speaking and writing, Rhonda challenges women to work passionately and purposefully with her Born to R.E.I.G.N.TM Methodology. Believing that everyone lives their legacy daily, Rhonda has founded two nonprofits that serve youth, building their"
    },
    {
      "title": "#48 Sandra Francisco - dealing with anxiety, imposter syndrome or overwhelm as a business owner",
      "date": "2021-09-26",
      "duration": 2425,
      "audio_url": "http://dts.podtrac.com/redirect.mp3/feeds.soundcloud.com/stream/1125226087-smallbusinesssisterhood-48-sandra-francisco-dealing-with-anxiety-imposter-syndrome-or-overwhelm-as-a-business-owner.mp3",
      "description": "Sandra Francisco is a Business Coach that helps entrepreneurs go from idea to profit while balancing their personal growth so that they can have fulfillment and profit.\nSandra spent 15 years as a marketing and product development expert for two of Canada's fortune 10 companies, after making the difficult decision to leave the corporate path, she found herself exploring professional coaching and the dynamics of the human psyche. The combination of her eclectic background in personal and professio"
    },
    {
      "title": "#47 Suzanne Tulien - how clarity around your personal brand can help you and your business",
      "date": "2021-09-12",
      "duration": 2385,
      "audio_url": "http://dts.podtrac.com/redirect.mp3/feeds.soundcloud.com/stream/1123986850-smallbusinesssisterhood-47-suzanne-tulien-how-clarity-around-your-personal-brand-can-help-you-and-your-business.mp3",
      "description": "Suzanne Tulien is a Brand Clarity Expert, author, and speaker who specializes in helping her clients identify, define, and align their brand to what they want to be known for. She’s a firm believer in the power of aligned branding and how it can help solopreneurs launch and grow a successful business. She is the author of three books: Brand DNA, Personal Brand Clarity, and The 6 Myths of Small Business Branding. She speaks, trains, and consults internationally.\nIn this episode Suzanne and I expl"
    }
  ],
  "status": "discovered",
  "pursue": false,
  "notes": "",
  "discovered_date": "2026-02-18",
  "slug": "small-business-sisterhood-podcast-online-business-blogging-creative-entrepreneur",
  "relevance": "Low",
  "score_reason": "Targets female solopreneurs and side hustlers, not the B2B/traditional industry decision-makers Andreas speaks to.",
  "contact_email": "admin@smallbusinesssisterhood.com",
  "contact_name": "Small Business Sisterhood Podcast",
  "contact_source": "rss"
}