{
  "source": "podcast_index",
  "name": "The Online SuperCoach Podcast | Attract, Sell & Serve like a Million Dollar Online Coach.",
  "host": "Dennison Silvio | Online Fitness Entrepreneur, Business Development Guru",
  "description": "The Online SuperCoach Podcast was created to help aspiring entrepreneurs build a prosperous online coaching business.\nThis podcast will teach you how to attract your ideal clients and how to convert them with high-ticket offers and sales webinars. You’ll also discover how to leverage your time using online coaching so you won't have to trade hours for dollars.\nUsing this model, you will convert clients by the masses (selling one-to-many instead of one-on-one). This way, you can help thousands of",
  "rss_url": "https://onlinesupercoach.libsyn.com/rss",
  "website": "http://onlinesupercoach.com",
  "language": "en",
  "categories": [
    "Business",
    "Health",
    "Fitness"
  ],
  "feed_id": "1099064",
  "last_episode_date": "",
  "episode_count": 195,
  "recent_episodes": [
    {
      "title": "Nikki Nash: Creating the Blueprint to 10X Your Online Business",
      "date": "2023-11-07",
      "duration": 1995,
      "audio_url": "https://traffic.libsyn.com/secure/onlinesupercoach/11-7_nikki_nash_podcast_OFFICIAL.m4a?dest-id=291019",
      "description": "<p >Nikki Nash has guided countless individuals in crafting effective customer acquisition and retention plans. </p> <p >Before venturing into the online education and coaching industry, Nikki spent a decade in the corporate trenches, contributing to the growth of both Fortune 100 corporations and tech startups. Her diverse career journey honed her expertise in client acquisition, brand advocacy, content marketing, and overarching marketing strategies.</p> <p >Not content with merely corporate s"
    },
    {
      "title": "Chantal Cornelius: Unlocking the Power of Emotions in Sales and Marketing",
      "date": "2023-10-10",
      "duration": 1740,
      "audio_url": "https://traffic.libsyn.com/secure/onlinesupercoach/10-10_Chantal_Cornelius_Podcast_official.m4a?dest-id=291019",
      "description": "<p >Chantal Cornelius has spent the last two decades helping hundreds of coaches grow their businesses and achieve their goals through making strong emotional connections with their clients.</p> <p >Chantal knows that the key to standing out from competitors is to build strong, long lasting relationships with clients. Her mission is to help business owners realize that the path to success doesn’t involve churning out endless social content. In her writing and speaking, Chantal introduces coaches"
    },
    {
      "title": "Darryl Stickel: Mastering Trust to Close High-Ticket Sales",
      "date": "2023-08-22",
      "duration": 2458,
      "audio_url": "https://traffic.libsyn.com/secure/onlinesupercoach/8-22_podcast_Offical_Audio.m4a?dest-id=291019",
      "description": "<p >Darryl Stickel stands as a prominent global authority on trust, focusing on equipping leaders with an indispensable tool. Darryl's unwavering positivity radiates, bringing out the best in people and reflecting his personal journey of resilience. His belief in a brighter collective future drives his commitment to building it collaboratively.</p> <p >With over two decades of experience, Dr. Stickel serves as an executive coach specializing in trust. His profound insights were crystallized thro"
    }
  ],
  "status": "discovered",
  "pursue": false,
  "notes": "",
  "discovered_date": "2026-02-18",
  "slug": "the-online-supercoach-podcast-attract-sell-serve-like-a-million-dollar-online-co",
  "relevance": "Low",
  "score_reason": "Focused on online coaching business models, not relevant to traditional industries, B2B marketing, or guest's expertise."
}