{
  "source": "podcast_index",
  "name": "The Data-Driven Marketer Podcast",
  "host": "Keen Decision Systems",
  "description": "With more marketing channels and pressure than ever, brand leaders need timely, accurate data to help them know where, when, and how to spend their hard-earned budgets to get the most ROI.\nIn the Data-Driven Marketer Podcast, team members from Keen Decision Systems sit down with industry leaders and marketing experts to share the insights, mindset, and tools that empower you to make data-driven decisions that will drive your brand’s performance.\nFor more information, visit https://keends.com\n",
  "rss_url": "https://fast.wistia.com/channels/4sf83qnhra/rss",
  "website": "https://fast.wistia.net/embed/channel/4sf83qnhra",
  "language": "en-us",
  "categories": [
    "Business"
  ],
  "feed_id": "7391198",
  "last_episode_date": "",
  "episode_count": 8,
  "recent_episodes": [
    {
      "title": "Full Funnel Measurement in Action: Quigley-Simpson's Layered Approach to Programmatic Strategy",
      "date": "2025-11-11",
      "duration": 2177,
      "audio_url": "https://podcast.wistia.com/deliveries/8d8934e9e226e5a4cb02a80884b0a6bd5dfe38b9.mp4?d=eyJtIjoxMzgwNzEyNTYsIm1kIjoyMTc2LjgzLCJhIjoid2lzdGlhLXByb2R1Y3Rpb25fMjE1MjEyMCIsImMiOjEyMDE3MSwiZSI6MjAwNjg2MSwiYiI6IjhkODkzNGU5ZTIyNmU1YTRjYjAyYTgwODg0YjBhNmJkNWRmZTM4YjkiLCJtYiI6MSwib2IiOjI3ODY4MzU5LjAwODI4MjY4OH0%3D--2f0875f90741d6e3f32d8537b2b2f283ef7579cd741b4be1f1d42a7ea3a16b45",
      "description": "<p>Join Jesse Math, VP of Strategic Partnerships at Keen Decision Systems, in conversation with Devyn McHugh, Director of Programmatic at Quigley-Simpson. They unpack full-funnel measurement that goes beyond weekly reports and last-touch attribution, with practical ways to capture both upper-funnel brand impact and lower-funnel conversions.</p><p>You’ll learn how to:</p><p>• Apply layered measurement combining multiple attribution approaches</p><p>• Treat programmatic as a cross-channel technolo"
    },
    {
      "title": "How to Fix the Measurement Gap and Drive Real Growth with Code3",
      "date": "2025-09-22",
      "duration": 2022,
      "audio_url": "https://podcast.wistia.com/deliveries/16d21469ec28bfeb6ac7e9ae92854caca4f5b81a.mp4?d=eyJtIjoxMzgyMjEzNDYsIm1kIjoyMDIxLjgzLCJhIjoid2lzdGlhLXByb2R1Y3Rpb25fMjE1MjEyMCIsImMiOjEyMDE3MSwiZSI6MTk3OTk0NywiYiI6IjE2ZDIxNDY5ZWMyOGJmZWI2YWM3ZTlhZTkyODU0Y2FjYTRmNWI4MWEiLCJtYiI6MSwib2IiOjI3NjU0NzY3LjMwNDg2NzM3Nn0%3D--756c11c086f4fe6c2560adcce52d85056dc1fbb71096113f62dfa62a32892251",
      "description": "Is your brand stuck in a cycle of hitting ROAS goals but seeing stagnant growth? You might have a measurement gap. In this episode, Ashleigh Shapiro, VP and Head of Growth at Code3, joins us to break down why this measurement gap exists and how to fix it.We explore the dangers of a ROAS-only mindset, the importance of incrementality, and the organizational changes needed to drive real, sustainable growth.Key Learnings:Discover why your marketing performance is likely stronger than you think due "
    },
    {
      "title": "Real-Time Marketing Optimization for Full-Funnel Growth with MikMak CEO Rachel Tipograph",
      "date": "2025-07-16",
      "duration": 1414,
      "audio_url": "https://podcast.wistia.com/deliveries/a9911d01be717ceb7cba8bf68965704bd1afc3b5.mp4?d=eyJtIjoxMzYxODAzMTgsIm1kIjoxNDE0LjI5LCJhIjoid2lzdGlhLXByb2R1Y3Rpb25fMjE1MjEyMCIsImMiOjEyMDE3MSwiZSI6MTk0MzAxNCwiYiI6ImE5OTExZDAxYmU3MTdjZWI3Y2JhOGJmNjg5NjU3MDRiZDFhZmMzYjUiLCJtYiI6MSwib2IiOjI0MjEwMTc0LjA2NjEzOTE5fQ%3D%3D--dc67282d4c0da18ea70bd728716aebf55c42a514414e57fdee2790524108056b",
      "description": "Modern marketing requires balancing strategic long-term planning with real-time tactical adjustments to drive sustainable growth in today's volatile digital landscape.Greg Dolan, CEO & Co-founder of Keen, sits down with Rachel Tipograph, founder and CEO of MikMak, to explore how leading brands are solving the challenge of optimizing for both long-term brand building and immediate performance. From the evolution of marketing attribution to the organizational changes required for success, this con"
    }
  ],
  "status": "pursuing",
  "pursue": true,
  "notes": "",
  "contact_email": "marketing@keends.com",
  "contact_name": "Keen Decision Systems",
  "discovered_date": "2026-02-18",
  "slug": "the-data-driven-marketer-podcast",
  "relevance": "High",
  "score_reason": "Marketing ROI, measurement, and data-driven decision-making is exactly Andreas's wheelhouse with his food marketing background and intelligence economy focus."
}