{
  "source": "podcast_index",
  "name": "The Digital Agency Show | Helping Agency Owners Transform Their Business Mindset to Increase Prices, Work Less, and Grow Profits",
  "host": "UGURUS Hosted by Brent Weaver",
  "description": "Helping digital agency owners transform their business mindset so they can increase prices, work less, and grow profits.\nA weekly podcast where host Brent Weaver chats with today's most successful entrepreneurs running digital agency businesses in the web design, web development, and digital marketing industry.\n  \nBrent also chats with high-profile entrepreneurs and other smart people that can help listeners grow their digital agency.\nEach interview deep dives into the emotional details of going",
  "rss_url": "https://feeds.soundcloud.com/users/soundcloud:users:271516141/sounds.rss",
  "website": "https://www.ugurus.com/podcast/",
  "language": "en",
  "categories": [
    "Business"
  ],
  "feed_id": "1114461",
  "last_episode_date": "",
  "episode_count": 377,
  "recent_episodes": [
    {
      "title": "Episode 376: The End of UGURUS – Last Episode with Brent Weaver and Jen Buzza",
      "date": "2025-03-30",
      "duration": 3267,
      "audio_url": "https://feeds.soundcloud.com/stream/2067787792-digitalagencyshow-episode-376-the-end-of-ugurus.mp3",
      "description": "In this final episode of the Digital Agency Show, host Brent Weaver gets interviewed by UGURUS Lead Mentor, Jennifer Buzza. They talk about the shutdown of UGURUS after 12 great years, lessons learned from the business and recording 375+ episodes, and much more. Tune in for this Brent's final thoughts on a great run."
    },
    {
      "title": "Episode 375: From Solo to Scalable: The Power of White Labeling for Agencies with Michael Knorr",
      "date": "2025-02-20",
      "duration": 1784,
      "audio_url": "https://feeds.soundcloud.com/stream/2039492412-digitalagencyshow-episode-375-from-solo-to-scalable-the-power-of-white-labeling-for-agencies-with-michael-knorr.mp3",
      "description": "Michael Knorr is the CEO of That! Company, a white-label digital marketing agency that has helped over 700 agencies scale their businesses by providing SEO, PPC, and digital marketing services under their clients’ brands. With nearly two decades of experience, Michael has built a business model that allows agency owners to grow without getting bogged down in execution—freeing them up to focus on strategy, client relationships, and revenue growth."
    },
    {
      "title": "Episode 374: Smarter PPC Strategies & The Future of Paid Ads with John Horn",
      "date": "2025-02-19",
      "duration": 1508,
      "audio_url": "https://feeds.soundcloud.com/stream/2039484917-digitalagencyshow-episode-374-smarter-ppc-strategies-the-future-of-paid-ads-with-john-horn.mp3",
      "description": "John Horn is the CEO of StubGroup, a digital advertising agency specializing in expert PPC management for businesses of all sizes. Since joining the company as employee number one, John has helped StubGroup grow into a leading boutique agency, managing over 15,000 campaigns and generating more than 3 million leads and $400 million in revenue for clients."
    }
  ],
  "status": "discovered",
  "pursue": false,
  "notes": "",
  "contact_email": "jo@ugurus.com",
  "contact_name": "The Digital Agency Show",
  "discovered_date": "2026-02-18",
  "slug": "the-digital-agency-show-helping-agency-owners-transform-their-business-mindset-t",
  "relevance": "High",
  "score_reason": "Perfect fit for Andreas's agency-building story (Nourish exit) and expertise in marketing, agency growth, and business transformation for practitioners."
}