{
  "source": "podcast_index",
  "name": "The Goal Digger Podcast | Top Business and Marketing Podcast for Creatives, Entrepreneurs, and Women in Business",
  "host": "Jenna Kutcher",
  "description": "You didn’t start your business to be a full-time content creator. You started it to help people, earn consistent income, and finally have the freedom you dreamed of.\nThe Goal Digger Podcast is your go-to show for clear marketing strategies, proven systems, and honest conversations that help you grow your business in a way that feels good and actually works. Hosted by Jenna Kutcher, New York Times bestselling author of How Are You, Really? and the self-made entrepreneur behind a seven-figure bran",
  "rss_url": "https://feeds.megaphone.fm/YAP4895144602",
  "website": "http://www.goaldiggerpodcast.com",
  "language": "en",
  "categories": [
    "Business",
    "Marketing"
  ],
  "feed_id": "432536",
  "last_episode_date": "",
  "episode_count": 968,
  "recent_episodes": [
    {
      "title": "This Isn't Goodbye. This Is the Goal.",
      "date": "2025-12-31",
      "duration": 2932,
      "audio_url": "https://www.podtrac.com/pts/redirect.mp3/pdst.fm/e/s.gum.fm/s-6515bbeef1f2e7a1aa7aaf27/pscrb.fm/rss/p/cohst.app/pdcst/3E4Q4G/traffic.megaphone.fm/YAP7339832112.mp3?updated=1766160471",
      "description": "<p>After 968 episodes and nearly a decade, I'm pausing the Goal Digger Podcast. Season one is complete, and I'm so excited about what comes next.</p>\n<p>I've been searching for women who stepped back at the height of their careers not from crisis or failure but from peace, intention, and pure joy. Those stories are rare, so I'm modeling it in real time: what it looks like when a woman makes a conscious, celebratory choice to step away from something that's working because she's designed her life"
    },
    {
      "title": "What My Husband Sees That the Internet Never Will",
      "date": "2025-12-29",
      "duration": 2554,
      "audio_url": "https://www.podtrac.com/pts/redirect.mp3/pdst.fm/e/s.gum.fm/s-6515bbeef1f2e7a1aa7aaf27/pscrb.fm/rss/p/cohst.app/pdcst/3E4Q4G/traffic.megaphone.fm/YAP6831819739.mp3?updated=1766160318",
      "description": "<p>Drew's back on the mic after a few years, and honestly, I wasn't sure what this conversation would uncover. We've been married for fourteen years, together for half of our lives, and we're standing at this threshold where both girls are finally in school full-time and we're asking ourselves: what do we actually want now?</p>\n<p>Not what we're supposed to want. Not what comes next on the achievement timeline. But what lights us up, what grounds us, what makes us feel alive.</p>\n<p>Drew never t"
    },
    {
      "title": "The Price of Entrepreneurship No One Talks About (And Why I'd Pay It Again)",
      "date": "2025-12-24",
      "duration": 2323,
      "audio_url": "https://www.podtrac.com/pts/redirect.mp3/pdst.fm/e/s.gum.fm/s-6515bbeef1f2e7a1aa7aaf27/pscrb.fm/rss/p/cohst.app/pdcst/3E4Q4G/traffic.megaphone.fm/YAP2724721445.mp3?updated=1766160233",
      "description": "<p>Becoming an entrepreneur is the most expensive personal development program you will ever pay for, and I'm not even talking about the money. I'm talking about the version of yourself that you have to let die: the people pleaser who waits for permission, the woman who apologizes before she speaks, that part of you who thinks staying ahead of everything will finally make you safe.</p>\n<p>I've watched the “girl boss” era rise and fall. I've witnessed hustle culture get worshipped and then finall"
    }
  ],
  "status": "discovered",
  "pursue": false,
  "notes": "",
  "discovered_date": "2026-02-18",
  "slug": "the-goal-digger-podcast-top-business-and-marketing-podcast-for-creatives-entrepr",
  "relevance": "Low",
  "score_reason": "Focused on solopreneurs and creatives rather than traditional industry decision-makers, and Andreas's B2B/corporate expertise doesn't align with the audience.",
  "contact_email": "podcast@jennakutcher.com",
  "contact_name": "Jenna Kutcher | Entrepreneurship, Business Strategy & Marketing",
  "contact_source": "rss"
}